Revit 2024 API
StairsType.HasMiddleSupports Property
 True if the stairs type has middle supports, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasMiddleSupports { get; set; }
Visual Basic
Public Property HasMiddleSupports As Boolean
	Get
	Set
Visual C++
public:
property bool HasMiddleSupports {
	bool get ();
	void set (bool value);
}
See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace